# Marco Briceño
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [19]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
# from pandas.tools.plotting import radviz

%matplotlib inline

In [20]:
mi_df = pd.DataFrame(({'a': [11,12,13], 'b': [21,22,23], 'c':[9,10,11]}))
print (mi_df)

    a   b   c
0  11  21   9
1  12  22  10
2  13  23  11

In [21]:
data = {'ciudad': ['Loja', 'Pichincha', 'Guayas'],
        'capital' : ['Loja', 'Quito', 'Guayaquil'],
        'zona'  : [7, 8, 1], '#Cantones' : [16, 44,21]}
frame = pd.DataFrame(data) # Creando un DataFrame desde un diccionario
frame

      ciudad    capital  zona  #Cantones
0       Loja       Loja     7         16
1  Pichincha      Quito     8         44
2     Guayas  Guayaquil     1         21

In [22]:
columnas = ['nombres','apellidos','cedula', 'Canton']

In [23]:
lista = [['rene', 'elizalde', '11041260','Loja'],
        ['rolando', 'solano', '11041261', 'Cariamanga'],
        ['Marco', 'Briceño', '1105295313', 'Loja']]

In [24]:
data = pd.DataFrame(lista, columns=columnas)

In [25]:
data

   nombres apellidos      cedula      Canton
0     rene  elizalde    11041260        Loja
1  rolando    solano    11041261  Cariamanga
2    Marco   Briceño  1105295313        Loja

In [26]:
lista2 = [['rene2', 'elizalde2', '11041263',' Loja'],
        ['rolando2', 'solano2', '11041264', ''],
          ['Marco', 'Briceño', '1105295313']]

In [27]:
data2 = pd.DataFrame(lista2, columns=columnas)

In [28]:
data2

    nombres  apellidos      cedula Canton
0     rene2  elizalde2    11041263   Loja
1  rolando2    solano2    11041264
2     Marco    Briceño  1105295313   None

In [29]:
data3 = pd.concat([data, data2])

In [30]:
data3

    nombres  apellidos      cedula      Canton
0      rene   elizalde    11041260        Loja
1   rolando     solano    11041261  Cariamanga
2     Marco    Briceño  1105295313        Loja
0     rene2  elizalde2    11041263        Loja
1  rolando2    solano2    11041264
2     Marco    Briceño  1105295313        None

In [31]:
data5 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041266'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito', 'Loja'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha', 'Loja']})

In [32]:
data5

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha
3  11041266       Loja       Loja

In [33]:
result = pd.merge(data3, data5, on='cedula')

In [34]:
result

   nombres  apellidos    cedula      Canton     Ciudad  Provincia
0     rene   elizalde  11041260        Loja  Guayaquil     Guayas
1  rolando     solano  11041261  Cariamanga     Cuenca      Azuay
2    rene2  elizalde2  11041263        Loja      Quito  Pichincha

In [35]:
data6 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})
data6

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha

In [36]:
data6 = pd.DataFrame({'Nombre': ['Marco', 'Patty', 'Lucho'],
 	'Apellidos': ['Briceño', 'Paredes', 'Kuday'],
	'Cedula': ['1105295313', '1110965432', '1906542786']})
data6

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha